''' Напишите программу, которая будет выводить на экран ваш любимый афоризм. Не забудьте о том, что автор
афоризма должен быть упомянут на отдельной строке.
'''
print(" Пригладись к тем,"
      "кто рядом с тобой."
      "С тобой ли они?"
      " или просто рядом")
print(" avtor:"," Эрих мария Ремарк")