''' Напишите и сохраните программу, которая будет выводить ваше имя и дожидаться, пока пользователь нажмет
Enter для выхода. Запустите эту программу, дважды щелкнув на ее значке.'''
print("меня  зовут мамаду:")
input("\n\nHaжмитe Enter. чтобы выйти.")