""" Напишите программу, в окно которой пользователь сможет ввести названия двух своих любимых блюд.
Программа должна щеплять две эти строки и выводить полученную строку как название нового невиданного
блюда. """
blouda1 = input("Введите вашу первую любимую блюда:")
blouda2 = input("Введите вашу вторую любимую блюда:")
print(" Первая блюда :",blouda1)
print(" Вторая блюда :",blouda2)
input("\n\nНажмите Enter. чтобы выйти.")