""" Напишите проrрамму, которая принимала бы текст из попьзовательского ввода и печатала этот текст на экране
наоборот. """
tect = input("Введите тест:")
tect_reverse = tect[::-1]
print(tect_reverse)